src/main/java/com/lld/problems/snakeandladder/notes/notes.md
```mermaid
sequenceDiagram
    participant SnakeAndLadderGame
    participant TurnManager
    participant Player
    participant Board
    participant Dice
    participant Pawn

    loop until checkWin(pawn) == true
        SnakeAndLadderGame->>TurnManager: getNextPlayer()
        TurnManager-->>SnakeAndLadderGame: Player

        SnakeAndLadderGame->>Player: chance(board)
        activate Player
        Player->>Dice: roll()
        Dice-->>Player: int
        Player->>Player: getPawn()
        Player->>Player: getCurrentPosition()
        Player->>Board: getFinalPosition(currPosition, steps)
        Board-->>Player: int
        Player->>Player: moveToCell(finalPosition)
        Player->>Pawn: updatePosition(finalPosition)
        deactivate Player

        SnakeAndLadderGame->>Player: getPawn()
        Player-->>SnakeAndLadderGame: Pawn

        SnakeAndLadderGame->>Board: checkWin(pawn)
        Board-->>SnakeAndLadderGame: boolean

        SnakeAndLadderGame->>Board: notifyPlayers(pawn)

        alt checkWin == true
            SnakeAndLadderGame->>SnakeAndLadderGame: end(winner)
        end
    end
```
